package org.itstep.qa.lesson;
import java.util.Scanner;
public class ZadachaEight {
    public static void main(String[] args) {
        //не сделала
        //Пользователь вводит строку. Программа выводит количество символов самого длинного слова.
        Scanner inn = new Scanner(System.in);
        System.out.println("Введите строку текста: ");
        String s1 = inn.nextLine();

        }
    }

